app/controllers/ric_eshop/public_orders_controller.rb

		def create

			# Next step or save
			if order_with_payment_valid?
				if params[:back_button]
					@order.previous_step
				elsif @order.last_step?
					if @order.all_valid?
						if customer_signed_in?
							@order.customer = current_customer
							@order.eligible_for_bonus = true
							if @order.use_bonus.to_s == '1'
								@order.normalize_used_bonus
								current_customer.bonus -= @order.used_bonus
								current_customer.save!
---
INSERT INTO "orders" ("session_id", "customer_name", "customer_email", "customer_phone", "delivery_type", "note", "payment_type", "customer_location_latitude", "customer_location_longitude", "customer_location_address", "customer_location_level", "created_at", "updated_at", "final_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
UPDATE "orders" SET "session_id" = $1, "customer_name" = $2, "customer_email" = $3, "customer_phone" = $4, "delivery_type" = $5, "note" = $6, "payment_type" = $7, "customer_location_latitude" = $8, "customer_location_longitude" = $9, "customer_location_address" = $10, "customer_location_level" = $11, "created_at" = $12, "updated_at" = $13, "final_price" = $14, "id" = $15, "forwarded_at" = $16 WHERE "orders"."id" = $17