app/views/shared/_force_closed_info.html.erb

SELECT  "kitchens".* FROM "kitchens"  ORDER BY "kitchens"."id" ASC LIMIT 1
---
		<div>
			<%= image_tag(image_url(Kitchen.instance.force_closed_picture.url(:full))) if Kitchen.instance.force_closed_picture.exists? %>