app/views/shared/_product.html.erb

SELECT  "product_photos".* FROM "product_photos" WHERE "product_photos"."product_id" = $1  ORDER BY "product_photos"."id" ASC LIMIT 1  [["product_id", 20]]
---

		<% first_product_photo = product.product_photos.first %>

SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."product_id" = $1  ORDER BY "product_variants"."position" ASC  [["product_id", 20]]
SELECT "products".* FROM "products" INNER JOIN "product_variants_products" ON "products"."id" = "product_variants_products"."product_id" WHERE "product_variants_products"."product_variant_id" = $1  ORDER BY "products"."position" ASC  [["product_variant_id", 2]]
---
				</div>
				<% product.product_variants.order(position: :asc).each do |product_variant| %>