app/views/shared/_tags.html.erb

	<ul>
		<% Tag.order(position: :asc).each do |tag| %>
---
SELECT "tags".* FROM "tags"  ORDER BY "tags"."position" ASC