app/controllers/homepage_controller.rb

	def index
		if @session.nil? || @session.location.nil? || @session.location[:address].empty?
			@session.update({location_latitude: '50.07433109999999', location_longitude: '14.3683756',
											 location_address: 'U Klikovky 3086/10, 150 00 Praha 5-Smíchov, Česko', location_level: 'address'})
			#puts "TRY session"
			#puts @session.inspect
		end
		restaurants = Restaurant.not_hidden.order(position: :asc)
---
SELECT "restaurants".* FROM "restaurants" WHERE (hidden IS NULL OR hidden = false)  ORDER BY "restaurants"."position" ASC