app/controllers/restaurants_controller.rb

	def set_restaurant
		@restaurant = Restaurant.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]