app/views/ric_eshop/order_mailer/restaurant_notice.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  ORDER BY "order_items"."restaurant_id" ASC, "order_items"."created_at" ASC  [["order_id", 5548]]
---
	<% last_restaurant = nil %>
	<% @order.order_items.order(restaurant_id: :asc, created_at: :asc).each do |order_item| %>