app/views/layouts/_side_left.html.erb

SELECT "tags".* FROM "tags"  ORDER BY "tags"."position" ASC
---
		<ul>
			<% Tag.order(position: :asc).each do |tag| %>